Terraform plan for __dev__
<details>
<summary>Plan: 1 to add, 0 to change, 6 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_project_iam_member.label_generator_service_account_iam[0] will be destroyed
  - resource "google_project_iam_member" "label_generator_service_account_iam" {
      - etag    = "BwXVxaQEcUk=" -> null
      - id      = "ebo-dev-321910/roles/datastore.user/serviceAccount:label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - member  = "serviceAccount:label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - project = "ebo-dev-321910" -> null
      - role    = "roles/datastore.user" -> null
    }

  # google_service_account.label_generator_bucket_access_sa will be destroyed
  - resource "google_service_account" "label_generator_bucket_access_sa" {
      - account_id   = "label-generator-file-upload" -> null
      - disabled     = false -> null
      - display_name = "Service account for uploading label_generator files" -> null
      - email        = "label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - id           = "projects/ebo-dev-321910/serviceAccounts/label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - name         = "projects/ebo-dev-321910/serviceAccounts/label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - project      = "ebo-dev-321910" -> null
      - unique_id    = "117067020294233879491" -> null
    }

  # google_service_account_iam_member.label_generator_service_account will be destroyed
  - resource "google_service_account_iam_member" "label_generator_service_account" {
      - etag               = "BwXVxaPNP3o=" -> null
      - id                 = "projects/ebo-dev-321910/serviceAccounts/label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/serviceAccount:ebo-dev-321910.svc.id.goog[ebo/label-generator-file-upload]" -> null
      - member             = "serviceAccount:ebo-dev-321910.svc.id.goog[ebo/label-generator-file-upload]" -> null
      - role               = "roles/iam.workloadIdentityUser" -> null
      - service_account_id = "projects/ebo-dev-321910/serviceAccounts/label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
    }

  # google_storage_bucket.label_generator_file_bucket must be replaced
-/+ resource "google_storage_bucket" "label_generator_file_bucket" {
      ~ bucket_policy_only          = true -> (known after apply)
      - default_event_based_hold    = false -> null
      ~ id                          = "********************" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "self-edge-labels-dev" -> "shelf-edge-labels-dev" # forces replacement
      ~ project                     = "ebo-dev-321910" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/self-edge-labels-dev" -> (known after apply)
      ~ url                         = "gs://self-edge-labels-dev" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # google_storage_bucket_iam_member.label_generator_service_account_iam will be destroyed
  - resource "google_storage_bucket_iam_member" "label_generator_service_account_iam" {
      - bucket = "b/self-edge-labels-dev" -> null
      - etag   = "CAI=" -> null
      - id     = "b/self-edge-labels-dev/roles/storage.admin/serviceAccount:label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - member = "serviceAccount:label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com" -> null
      - role   = "roles/storage.admin" -> null
    }

  # kubernetes_service_account.label_generator_service_account will be destroyed
  - resource "kubernetes_service_account" "label_generator_service_account" {
      - automount_service_account_token = true -> null
      - default_secret_name             = "label-generator-file-upload-token-6l5j5" -> null
      - id                              = "ebo/label-generator-file-upload" -> null

      - metadata {
          - annotations      = {
              - "iam.gke.io/gcp-service-account" = "label-generator-file-upload@ebo-dev-321910.iam.gserviceaccount.com"
            } -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "label-generator-file-upload" -> null
          - namespace        = "ebo" -> null
          - resource_version = "93661286" -> null
          - uid              = "ac33ae84-a23b-46f2-a46f-1310a9ab2d32" -> null
        }
    }

Plan: 1 to add, 0 to change, 6 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #402](https://github.com/ebomart/commerce-infrastructure/actions/runs/1711516951)